/*
 * @Author: funlee
 * @Email: i@funlee.cn
 * @Date: 2018-05-24 11:44:00
 * @Description: 世界地图、中国地图绘制所需的常量 
 */
export const nameMap = {
  '': '其他地区',
  'Afghanistan': '阿富汗',
  'Albania': '阿尔巴尼亚',
  'Algeria': '阿尔及利亚',
  'Andorra': '安道尔',
  'Angola': '安哥拉',
  'Antarctica': '南极洲',
  'Antigua and Barbuda': '安提瓜和巴布达',
  'Argentina': '阿根廷',
  'Armenia': '亚美尼亚',
  'Australia': '澳大利亚',
  'Austria': '奥地利',
  'Azerbaijan': '阿塞拜疆',
  'The Bahamas': '巴哈马',
  'Bahrain': '巴林',
  'Bangladesh': '孟加拉国',
  'Barbados': '巴巴多斯',
  'Belarus': '白俄罗斯',
  'Belgium': '比利时',
  'Belize': '伯利兹',
  'Benin': '贝宁',
  'Bermuda': '百慕大',
  'Bhutan': '不丹',
  'Bolivia': '玻利维亚',
  'Bosnia and Herzegovina': '波斯尼亚和黑塞哥维那',
  'Botswana': '博茨瓦纳',
  'Brazil': '巴西',
  'Brunei': '文莱',
  'Bulgaria': '保加利亚',
  'Burkina Faso': '布基纳法索',
  'Burundi': '布隆迪',
  'Cambodia': '柬埔寨',
  'Cameroon': '喀麦隆',
  'Canada': '加拿大',
  'Cape Verde': '佛得角',
  'Central African Republic': '中非共和国',
  'Chad': '乍得',
  'Chile': '智利',
  'China': '中国',
  'Colombia': '哥伦比亚',
  'Comoros': '科摩罗',
  'Republic of the Congo': '刚果共和国',
  'Costa Rica': '哥斯达黎加',
  'Croatia': '克罗地亚',
  'Cuba': '古巴',
  'Cyprus': '塞浦路斯',
  'Czech Republic': '捷克共和国',
  'Denmark': '丹麦',
  'Djibouti': '吉布提',
  'Dominica': '多米尼加',
  'Dominican Republic': '多明尼加共和国',
  'Ecuador': '厄瓜多尔',
  'Egypt': '埃及',
  'El Salvador': '萨尔瓦多',
  'Equatorial Guinea': '赤道几内亚',
  'Eritrea': '厄立特里亚',
  'Estonia': '爱沙尼亚',
  'Ethiopia': '埃塞俄比亚',
  'Falkland Islands': '福克兰群岛',
  'Faroe Islands': '法罗群岛',
  'Fiji': '斐济',
  'Finland': '芬兰',
  'France': '法国',
  'French Guiana': '法属圭亚那',
  'French Southern and Antarctic Lands': '法属南半球和南极领地',
  'Gabon': '加蓬',
  'Gambia': '冈比亚',
  'Gaza Strip': '加沙',
  'Georgia': '格鲁吉亚',
  'Germany': '德国',
  'Ghana': '加纳',
  'Greece': '希腊',
  'Greenland': '格陵兰',
  'Grenada': '格林纳达',
  'Guadeloupe': '瓜德罗普',
  'Guatemala': '危地马拉',
  'Guinea': '几内亚',
  'Guinea Bissau': '几内亚比绍',
  'Guyana': '圭亚那',
  'Haiti': '海地',
  'Honduras': '洪都拉斯',
  'Hong Kong': '香港',
  'Hungary': '匈牙利',
  'Iceland': '冰岛',
  'India': '印度',
  'Indonesia': '印尼',
  'Iran': '伊朗',
  'Iraq': '伊拉克',
  'Iraq-Saudi Arabia Neutral Zone': '伊拉克阿拉伯中立区',
  'Ireland': '爱尔兰',
  'Isle of Man': '马恩岛',
  'Israel': '以色列',
  'Italy': '意大利',
  'Ivory Coast': '科特迪瓦',
  'Jamaica': '牙买加',
  'Jan Mayen': '扬马延岛',
  'Japan': '日本',
  'Jordan': '约旦',
  'Kazakhstan': '哈萨克斯坦',
  'Kenya': '肯尼亚',
  'Kerguelen': '凯尔盖朗群岛',
  'Kiribati': '基里巴斯',
  'North Korea': '北朝鲜',
  'South Korea': '韩国',
  'Kuwait': '科威特',
  'Kyrgyzstan': '吉尔吉斯斯坦',
  'Laos': '老挝',
  'Latvia': '拉脱维亚',
  'Lebanon': '黎巴嫩',
  'Lesotho': '莱索托',
  'Liberia': '利比里亚',
  'Libya': '利比亚',
  'Liechtenstein': '列支敦士登',
  'Lithuania': '立陶宛',
  'Luxembourg': '卢森堡',
  'Macau': '澳门',
  'Macedonia': '马其顿',
  'Madagascar': '马达加斯加',
  'Malawi': '马拉维',
  'Malaysia': '马来西亚',
  'Maldives': '马尔代夫',
  'Mali': '马里',
  'Malta': '马耳他',
  'Martinique': '马提尼克',
  'Mauritania': '毛里塔尼亚',
  'Mauritius': '毛里求斯',
  'Mexico': '墨西哥',
  'Moldova': '摩尔多瓦',
  'Monaco': '摩纳哥',
  'Mongolia': '蒙古',
  'Morocco': '摩洛哥',
  'Mozambique': '莫桑比克',
  'Myanmar': '缅甸',
  'Namibia': '纳米比亚',
  'Nepal': '尼泊尔',
  'Netherlands': '荷兰',
  'New Caledonia': '新喀里多尼亚',
  'New Zealand': '新西兰',
  'Nicaragua': '尼加拉瓜',
  'Niger': '尼日尔',
  'Nigeria': '尼日利亚',
  'Northern Mariana Islands': '北马里亚纳群岛',
  'Norway': '挪威',
  'Oman': '阿曼',
  'Pakistan': '巴基斯坦',
  'Panama': '巴拿马',
  'Papua New Guinea': '巴布亚新几内亚',
  'Paraguay': '巴拉圭',
  'Peru': '秘鲁',
  'Philippines': '菲律宾',
  'Poland': '波兰',
  'Portugal': '葡萄牙',
  'Puerto Rico': '波多黎各',
  'Qatar': '卡塔尔',
  'Reunion': '留尼旺岛',
  'Romania': '罗马尼亚',
  'Russia': '俄罗斯',
  'Rwanda': '卢旺达',
  'San Marino': '圣马力诺',
  'Sao Tome and Principe': '圣多美和普林西比',
  'Saudi Arabia': '沙特阿拉伯',
  'Senegal': '塞内加尔',
  'Seychelles': '塞舌尔',
  'Sierra Leone': '塞拉利昂',
  'Singapore': '新加坡',
  'Slovakia': '斯洛伐克',
  'Slovenia': '斯洛文尼亚',
  'Solomon Islands': '所罗门群岛',
  'Somalia': '索马里',
  'South Africa': '南非',
  'Spain': '西班牙',
  'Sri Lanka': '斯里兰卡',
  'St. Christopher-Nevis': '圣',
  'St. Lucia': '圣露西亚',
  'St. Vincent and the Grenadines': '圣文森特和格林纳丁斯',
  'Sudan': '苏丹',
  'Suriname': '苏里南',
  'Svalbard': '斯瓦尔巴特群岛',
  'Swaziland': '斯威士兰',
  'Sweden': '瑞典',
  'Switzerland': '瑞士',
  'Syria': '叙利亚',
  'Taiwan': '台湾',
  'Tajikistan': '塔吉克斯坦',
  'United Republic of Tanzania': '坦桑尼亚',
  'Thailand': '泰国',
  'Togo': '多哥',
  'Tonga': '汤加',
  'Trinidad and Tobago': '特里尼达和多巴哥',
  'Tunisia': '突尼斯',
  'Turkey': '土耳其',
  'Turkmenistan': '土库曼斯坦',
  'Turks and Caicos Islands': '特克斯和凯科斯群岛',
  'Uganda': '乌干达',
  'Ukraine': '乌克兰',
  'United Arab Emirates': '阿联酋',
  'United Kingdom': '英国',
  'United States of America': '美国',
  'Uruguay': '乌拉圭',
  'Uzbekistan': '乌兹别克斯坦',
  'Vanuatu': '瓦努阿图',
  'Venezuela': '委内瑞拉',
  'Vietnam': '越南',
  'Western Sahara': '西撒哈拉',
  'Western Samoa': '西萨摩亚',
  'Yemen': '也门',
  'Yugoslavia': '南斯拉夫',
  'Democratic Republic of the Congo': '刚果民主共和国',
  'Zambia': '赞比亚',
  'Zimbabwe': '津巴布韦',
  'South Sudan': '南苏丹',
  'Somaliland': '索马里兰',
  'Montenegro': '黑山',
  'Kosovo': '科索沃',
  'Republic of Serbia': '塞尔维亚',
};

export const worldDataTpl = [
  {
    "name": "其他地区",
    "value": 0
  }, {
    "name": "阿富汗",
    "value": 0
  }, {
    "name": "阿尔巴尼亚",
    "value": 0
  }, {
    "name": "阿尔及利亚",
    "value": 0
  }, {
    "name": "安道尔",
    "value": 0
  }, {
    "name": "安哥拉",
    "value": 0
  }, {
    "name": "南极洲",
    "value": 0
  }, {
    "name": "安提瓜和巴布达",
    "value": 0
  }, {
    "name": "阿根廷",
    "value": 0
  }, {
    "name": "亚美尼亚",
    "value": 0
  }, {
    "name": "澳大利亚",
    "value": 0
  }, {
    "name": "奥地利",
    "value": 0
  }, {
    "name": "阿塞拜疆",
    "value": 0
  }, {
    "name": "巴哈马",
    "value": 0
  }, {
    "name": "巴林",
    "value": 0
  }, {
    "name": "孟加拉国",
    "value": 0
  }, {
    "name": "巴巴多斯",
    "value": 0
  }, {
    "name": "白俄罗斯",
    "value": 0
  }, {
    "name": "比利时",
    "value": 0
  }, {
    "name": "伯利兹",
    "value": 0
  }, {
    "name": "贝宁",
    "value": 0
  }, {
    "name": "百慕大",
    "value": 0
  }, {
    "name": "不丹",
    "value": 0
  }, {
    "name": "玻利维亚",
    "value": 0
  }, {
    "name": "波斯尼亚和黑塞哥维那",
    "value": 0
  }, {
    "name": "博茨瓦纳",
    "value": 0
  }, {
    "name": "巴西",
    "value": 0
  }, {
    "name": "文莱",
    "value": 0
  }, {
    "name": "保加利亚",
    "value": 0
  }, {
    "name": "布基纳法索",
    "value": 0
  }, {
    "name": "布隆迪",
    "value": 0
  }, {
    "name": "柬埔寨",
    "value": 0
  }, {
    "name": "喀麦隆",
    "value": 0
  }, {
    "name": "加拿大",
    "value": 0
  }, {
    "name": "佛得角",
    "value": 0
  }, {
    "name": "中非共和国",
    "value": 0
  }, {
    "name": "乍得",
    "value": 0
  }, {
    "name": "智利",
    "value": 0
  }, {
    "name": "中国",
    "value": 0
  }, {
    "name": "哥伦比亚",
    "value": 0
  }, {
    "name": "科摩罗",
    "value": 0
  }, {
    "name": "刚果共和国",
    "value": 0
  }, {
    "name": "哥斯达黎加",
    "value": 0
  }, {
    "name": "克罗地亚",
    "value": 0
  }, {
    "name": "古巴",
    "value": 0
  }, {
    "name": "塞浦路斯",
    "value": 0
  }, {
    "name": "捷克共和国",
    "value": 0
  }, {
    "name": "丹麦",
    "value": 0
  }, {
    "name": "吉布提",
    "value": 0
  }, {
    "name": "多米尼加",
    "value": 0
  }, {
    "name": "多明尼加共和国",
    "value": 0
  }, {
    "name": "厄瓜多尔",
    "value": 0
  }, {
    "name": "埃及",
    "value": 0
  }, {
    "name": "萨尔瓦多",
    "value": 0
  }, {
    "name": "赤道几内亚",
    "value": 0
  }, {
    "name": "厄立特里亚",
    "value": 0
  }, {
    "name": "爱沙尼亚",
    "value": 0
  }, {
    "name": "埃塞俄比亚",
    "value": 0
  }, {
    "name": "福克兰群岛",
    "value": 0
  }, {
    "name": "法罗群岛",
    "value": 0
  }, {
    "name": "斐济",
    "value": 0
  }, {
    "name": "芬兰",
    "value": 0
  }, {
    "name": "法国",
    "value": 0
  }, {
    "name": "法属圭亚那",
    "value": 0
  }, {
    "name": "法属南半球和南极领地",
    "value": 0
  }, {
    "name": "加蓬",
    "value": 0
  }, {
    "name": "冈比亚",
    "value": 0
  }, {
    "name": "加沙",
    "value": 0
  }, {
    "name": "格鲁吉亚",
    "value": 0
  }, {
    "name": "德国",
    "value": 0
  }, {
    "name": "加纳",
    "value": 0
  }, {
    "name": "希腊",
    "value": 0
  }, {
    "name": "格陵兰",
    "value": 0
  }, {
    "name": "格林纳达",
    "value": 0
  }, {
    "name": "瓜德罗普",
    "value": 0
  }, {
    "name": "危地马拉",
    "value": 0
  }, {
    "name": "几内亚",
    "value": 0
  }, {
    "name": "几内亚比绍",
    "value": 0
  }, {
    "name": "圭亚那",
    "value": 0
  }, {
    "name": "海地",
    "value": 0
  }, {
    "name": "洪都拉斯",
    "value": 0
  }, {
    "name": "香港",
    "value": 0
  }, {
    "name": "匈牙利",
    "value": 0
  }, {
    "name": "冰岛",
    "value": 0
  }, {
    "name": "印度",
    "value": 0
  }, {
    "name": "印尼",
    "value": 0
  }, {
    "name": "伊朗",
    "value": 0
  }, {
    "name": "伊拉克",
    "value": 0
  }, {
    "name": "伊拉克阿拉伯中立区",
    "value": 0
  }, {
    "name": "爱尔兰",
    "value": 0
  }, {
    "name": "马恩岛",
    "value": 0
  }, {
    "name": "以色列",
    "value": 0
  }, {
    "name": "意大利",
    "value": 0
  }, {
    "name": "科特迪瓦",
    "value": 0
  }, {
    "name": "牙买加",
    "value": 0
  }, {
    "name": "扬马延岛",
    "value": 0
  }, {
    "name": "日本",
    "value": 0
  }, {
    "name": "约旦",
    "value": 0
  }, {
    "name": "哈萨克斯坦",
    "value": 0
  }, {
    "name": "肯尼亚",
    "value": 0
  }, {
    "name": "凯尔盖朗群岛",
    "value": 0
  }, {
    "name": "基里巴斯",
    "value": 0
  }, {
    "name": "北朝鲜",
    "value": 0
  }, {
    "name": "韩国",
    "value": 0
  }, {
    "name": "科威特",
    "value": 0
  }, {
    "name": "吉尔吉斯斯坦",
    "value": 0
  }, {
    "name": "老挝",
    "value": 0
  }, {
    "name": "拉脱维亚",
    "value": 0
  }, {
    "name": "黎巴嫩",
    "value": 0
  }, {
    "name": "莱索托",
    "value": 0
  }, {
    "name": "利比里亚",
    "value": 0
  }, {
    "name": "利比亚",
    "value": 0
  }, {
    "name": "列支敦士登",
    "value": 0
  }, {
    "name": "立陶宛",
    "value": 0
  }, {
    "name": "卢森堡",
    "value": 0
  }, {
    "name": "澳门",
    "value": 0
  }, {
    "name": "马其顿",
    "value": 0
  }, {
    "name": "马达加斯加",
    "value": 0
  }, {
    "name": "马拉维",
    "value": 0
  }, {
    "name": "马来西亚",
    "value": 0
  }, {
    "name": "马尔代夫",
    "value": 0
  }, {
    "name": "马里",
    "value": 0
  }, {
    "name": "马耳他",
    "value": 0
  }, {
    "name": "马提尼克",
    "value": 0
  }, {
    "name": "毛里塔尼亚",
    "value": 0
  }, {
    "name": "毛里求斯",
    "value": 0
  }, {
    "name": "墨西哥",
    "value": 0
  }, {
    "name": "摩尔多瓦",
    "value": 0
  }, {
    "name": "摩纳哥",
    "value": 0
  }, {
    "name": "蒙古",
    "value": 0
  }, {
    "name": "摩洛哥",
    "value": 0
  }, {
    "name": "莫桑比克",
    "value": 0
  }, {
    "name": "缅甸",
    "value": 0
  }, {
    "name": "纳米比亚",
    "value": 0
  }, {
    "name": "尼泊尔",
    "value": 0
  }, {
    "name": "荷兰",
    "value": 0
  }, {
    "name": "新喀里多尼亚",
    "value": 0
  }, {
    "name": "新西兰",
    "value": 0
  }, {
    "name": "尼加拉瓜",
    "value": 0
  }, {
    "name": "尼日尔",
    "value": 0
  }, {
    "name": "尼日利亚",
    "value": 0
  }, {
    "name": "北马里亚纳群岛",
    "value": 0
  }, {
    "name": "挪威",
    "value": 0
  }, {
    "name": "阿曼",
    "value": 0
  }, {
    "name": "巴基斯坦",
    "value": 0
  }, {
    "name": "巴拿马",
    "value": 0
  }, {
    "name": "巴布亚新几内亚",
    "value": 0
  }, {
    "name": "巴拉圭",
    "value": 0
  }, {
    "name": "秘鲁",
    "value": 0
  }, {
    "name": "菲律宾",
    "value": 0
  }, {
    "name": "波兰",
    "value": 0
  }, {
    "name": "葡萄牙",
    "value": 0
  }, {
    "name": "波多黎各",
    "value": 0
  }, {
    "name": "卡塔尔",
    "value": 0
  }, {
    "name": "留尼旺岛",
    "value": 0
  }, {
    "name": "罗马尼亚",
    "value": 0
  }, {
    "name": "俄罗斯",
    "value": 0
  }, {
    "name": "卢旺达",
    "value": 0
  }, {
    "name": "圣马力诺",
    "value": 0
  }, {
    "name": "圣多美和普林西比",
    "value": 0
  }, {
    "name": "沙特阿拉伯",
    "value": 0
  }, {
    "name": "塞内加尔",
    "value": 0
  }, {
    "name": "塞舌尔",
    "value": 0
  }, {
    "name": "塞拉利昂",
    "value": 0
  }, {
    "name": "新加坡",
    "value": 0
  }, {
    "name": "斯洛伐克",
    "value": 0
  }, {
    "name": "斯洛文尼亚",
    "value": 0
  }, {
    "name": "所罗门群岛",
    "value": 0
  }, {
    "name": "索马里",
    "value": 0
  }, {
    "name": "南非",
    "value": 0
  }, {
    "name": "西班牙",
    "value": 0
  }, {
    "name": "斯里兰卡",
    "value": 0
  }, {
    "name": "圣",
    "value": 0
  }, {
    "name": "圣露西亚",
    "value": 0
  }, {
    "name": "圣文森特和格林纳丁斯",
    "value": 0
  }, {
    "name": "苏丹",
    "value": 0
  }, {
    "name": "苏里南",
    "value": 0
  }, {
    "name": "斯瓦尔巴特群岛",
    "value": 0
  }, {
    "name": "斯威士兰",
    "value": 0
  }, {
    "name": "瑞典",
    "value": 0
  }, {
    "name": "瑞士",
    "value": 0
  }, {
    "name": "叙利亚",
    "value": 0
  }, {
    "name": "台湾",
    "value": 0
  }, {
    "name": "塔吉克斯坦",
    "value": 0
  }, {
    "name": "坦桑尼亚",
    "value": 0
  }, {
    "name": "泰国",
    "value": 0
  }, {
    "name": "多哥",
    "value": 0
  }, {
    "name": "汤加",
    "value": 0
  }, {
    "name": "特里尼达和多巴哥",
    "value": 0
  }, {
    "name": "突尼斯",
    "value": 0
  }, {
    "name": "土耳其",
    "value": 0
  }, {
    "name": "土库曼斯坦",
    "value": 0
  }, {
    "name": "特克斯和凯科斯群岛",
    "value": 0
  }, {
    "name": "乌干达",
    "value": 0
  }, {
    "name": "乌克兰",
    "value": 0
  }, {
    "name": "阿联酋",
    "value": 0
  }, {
    "name": "英国",
    "value": 0
  }, {
    "name": "美国",
    "value": 0
  }, {
    "name": "乌拉圭",
    "value": 0
  }, {
    "name": "乌兹别克斯坦",
    "value": 0
  }, {
    "name": "瓦努阿图",
    "value": 0
  }, {
    "name": "委内瑞拉",
    "value": 0
  }, {
    "name": "越南",
    "value": 0
  }, {
    "name": "西撒哈拉",
    "value": 0
  }, {
    "name": "西萨摩亚",
    "value": 0
  }, {
    "name": "也门",
    "value": 0
  }, {
    "name": "南斯拉夫",
    "value": 0
  }, {
    "name": "刚果民主共和国",
    "value": 0
  }, {
    "name": "赞比亚",
    "value": 0
  }, {
    "name": "津巴布韦",
    "value": 0
  }, {
    "name": "南苏丹",
    "value": 0
  }, {
    "name": "索马里兰",
    "value": 0
  }, {
    "name": "黑山",
    "value": 0
  }, {
    "name": "科索沃",
    "value": 0
  }, {
    "name": "塞尔维亚",
    "value": 0
  }
];

export const chinaDataTpl = [
  { "name": "北京", "value": 0 },
  { "name": "天津", "value": 0 },
  { "name": "河北", "value": 0 },
  { "name": "山西", "value": 0 },
  { "name": "内蒙古", "value": 0 },
  { "name": "辽宁", "value": 0 },
  { "name": "吉林", "value": 0 },
  { "name": "黑龙江", "value": 0 },
  { "name": "上海", "value": 0 },
  { "name": "江苏", "value": 0 },
  { "name": "浙江", "value": 0 },
  { "name": "安徽", "value": 0 },
  { "name": "福建", "value": 0 },
  { "name": "江西", "value": 0 },
  { "name": "山东", "value": 0 },
  { "name": "河南", "value": 0 },
  { "name": "湖北", "value": 0 },
  { "name": "湖南", "value": 0 },
  { "name": "重庆", "value": 0 },
  { "name": "四川", "value": 0 },
  { "name": "贵州", "value": 0 },
  { "name": "云南", "value": 0 },
  { "name": "西藏", "value": 0 },
  { "name": "陕西", "value": 0 },
  { "name": "甘肃", "value": 0 },
  { "name": "青海", "value": 0 },
  { "name": "宁夏", "value": 0 },
  { "name": "新疆", "value": 0 },
  { "name": "广东", "value": 0 },
  { "name": "广西", "value": 0 },
  { "name": "海南", "value": 0 },
  { "name": "台湾", "value": 0 },
  { "name": "香港", "value": 0 },
  { "name": "澳门", "value": 0 }
];

export const chinaGeoCoord = {
  "上海": [121.472644, 31.231706],
  "云南": [102.712251, 24.040609],
  "内蒙古": [111.670801, 40.818311],
  "北京": [116.405285, 39.904989],
  "台湾": [121.509062, 25.044332],
  "吉林": [125.3245, 43.886841],
  "四川": [103.065735, 30.659462],
  "天津": [119.190182, 39.125596],
  "宁夏": [106.278179, 38.46637],
  "安徽": [117.283042, 31.86119],
  "山东": [118.000923, 36.675807],
  "山西": [112.049248, 37.057014],
  "广东": [113.280637, 23.125178],
  "广西": [108.320004, 22.82402],
  "新疆": [87.617733, 43.792818],
  "江苏": [119.467413, 33.741544],
  "江西": [115.892151, 28.676493],
  "河北": [114.802461, 37.745474],
  "河南": [113.665412, 33.757975],
  "浙江": [120.153576, 29.287459],
  "海南": [110.33119, 20.031971],
  "湖北": [113.298572, 30.984355],
  "湖南": [112.12279, 28.19409],
  '澳门': [113.54909, 22.198951],
  "甘肃": [103.823557, 36.058039],
  "福建": [119.306239, 26.075302],
  "西藏": [91.132212, 29.660361],
  "贵州": [106.713478, 26.578343],
  "辽宁": [123.029096, 41.396767],
  "重庆": [106.504962, 29.933155],
  "陕西": [108.948024, 34.263161],
  "青海": [100.578916, 36.623178],
  "香港": [114.173355, 22.320048],
  "黑龙江": [126.642464, 46.756967],
};

export const worldGeoCoord = {
  "阿富汗": [69.11, 34.28],
  "阿尔巴尼亚": [19.49, 41.18],
  "阿尔及利亚": [3.08, 36.42],
  "美属萨摩亚": [-170.43, -14.16],
  "安道尔": [1.32, 42.31],
  "安哥拉": [13.15, -8.50],
  "安提瓜和巴布达": [-61.48, 17.20],
  "阿根廷": [-60.00, -36.30],
  "亚美尼亚": [44.31, 40.10],
  "阿鲁巴": [-70.02, 12.32],
  "澳大利亚": [149.08, -35.15],
  "奥地利": [16.22, 48.12],
  "阿塞拜疆": [49.56, 40.29],
  "巴哈马": [-77.20, 25.05],
  "巴林": [50.30, 26.10],
  "孟加拉国": [90.26, 23.43],
  "巴巴多斯": [-59.30, 13.05],
  "白俄罗斯": [27.30, 53.52],
  "比利时": [4.21, 50.51],
  "伯利兹": [-88.30, 17.18],
  "贝宁": [2.42, 6.23],
  "不丹": [89.45, 27.31],
  "玻利维亚": [-68.10, -16.20],
  "波斯尼亚和黑塞哥维那": [18.26, 43.52],
  "博茨瓦纳": [25.57, -24.45],
  "巴西": [-47.55, -15.47],
  "英属维尔京群岛": [-64.37, 18.27],
  "文莱": [115.00, 4.52],
  "保加利亚": [23.20, 42.45],
  "布基纳法索": [-1.30, 12.15],
  "布隆迪": [29.18, -3.16],
  "柬埔寨": [104.55, 11.33],
  "喀麦隆": [11.35, 3.50],
  "加拿大": [-75.42, 45.27],
  "佛得角": [-23.34, 15.02],
  "开曼群岛": [-81.24, 19.20],
  "中非共和国": [18.35, 4.23],
  "乍得": [14.59, 12.10],
  "智利": [-70.40, -33.24],
  "中国": [116.20, 39.55],
  "哥伦比亚": [-74.00, 4.34],
  "科摩罗": [43.16, -11.40],
  "刚果": [15.12, -4.09],
  "哥斯达黎加": [-84.02, 9.55],
  "科特迪瓦": [-5.17, 6.49],
  "克罗地亚": [15.58, 45.50],
  "古巴": [-82.22, 23.08],
  "塞浦路斯": [33.25, 35.10],
  "捷克共和国": [14.22, 50.05],
  "朝鲜": [125.30, 39.09],
  "刚果(扎伊尔)": [15.15, -4.20],
  "丹麦": [12.34, 55.41],
  "吉布提": [42.20, 11.08],
  "多米尼加": [-61.24, 15.20],
  "多米尼加共和国": [-69.59, 18.30],
  "东帝汶": [125.34, -8.29],
  "厄瓜多尔": [-78.35, -0.15],
  "埃及": [31.14, 30.01],
  "萨尔瓦多": [-89.10, 13.40],
  "赤道几内亚": [8.50, 3.45],
  "厄立特里亚": [38.55, 15.19],
  "爱沙尼亚": [24.48, 59.22],
  "埃塞俄比亚": [38.42, 9.02],
  "福克兰群岛(马尔维纳斯群岛)": [-59.51, -51.40],
  "法罗群岛": [-6.56, 62.05],
  "斐济": [178.30, -18.06],
  "芬兰": [25.03, 60.15],
  "法国": [2.20, 48.50],
  "法属圭亚那": [-52.18, 5.05],
  "法属波利尼西亚": [-149.34, -17.32],
  "加蓬": [9.26, 0.25],
  "冈比亚": [-16.40, 13.28],
  "格鲁吉亚": [44.50, 41.43],
  "德国": [13.25, 52.30],
  "加纳": [-0.06, 5.35],
  "希腊": [23.46, 37.58],
  "格陵兰": [-51.35, 64.10],
  "瓜德罗普岛": [-61.44, 16.00],
  "危地马拉": [-90.22, 14.40],
  "根西岛": [-2.33, 49.26],
  "几内亚": [-13.49, 9.29],
  "几内亚比绍": [-15.45, 11.45],
  "圭亚那": [-58.12, 6.50],
  "海地": [-72.20, 18.40],
  "赫德岛和麦当劳群岛": [74.00, -53.00],
  "洪都拉斯": [-87.14, 14.05],
  "匈牙利": [19.05, 47.29],
  "冰岛": [-21.57, 64.10],
  "印度": [77.13, 28.37],
  "印度尼西亚": [106.49, -6.09],
  "伊朗": [51.30, 35.44],
  "伊拉克": [44.30, 33.20],
  "爱尔兰": [-6.15, 53.21],
  "以色列": [35.12, 31.47],
  "意大利": [12.29, 41.54],
  "牙买加": [-76.50, 18.00],
  "约旦": [35.52, 31.57],
  "哈萨克斯坦": [71.30, 51.10],
  "肯尼亚": [36.48, -1.17],
  "基里巴斯": [173.00, 1.30],
  "科威特": [48.00, 29.30],
  "吉尔吉斯斯坦": [74.46, 42.54],
  "老挝": [102.36, 17.58],
  "拉脱维亚": [24.08, 56.53],
  "黎巴嫩": [35.31, 33.53],
  "莱索托": [27.30, -29.18],
  "利比里亚": [-10.47, 6.18],
  "阿拉伯利比亚民众国": [13.07, 32.49],
  "列支敦士登": [9.31, 47.08],
  "立陶宛": [25.19, 54.38],
  "卢森堡": [6.09, 49.37],
  "马达加斯加": [47.31, -18.55],
  "马拉维": [33.48, -14.00],
  "马来西亚": [101.41, 3.09],
  "马尔代夫": [73.28, 4.00],
  "马里": [-7.55, 12.34],
  "马耳他": [14.31, 35.54],
  "马提尼克岛": [-61.02, 14.36],
  "毛里塔尼亚": [57.30, -20.10],
  "马约特岛": [45.14, -12.48],
  "墨西哥": [-99.10, 19.20],
  "密克罗尼西亚(联邦) ": [158.09, 6.55],
  "摩尔多瓦共和国": [28.50, 47.02],
  "莫桑比克": [32.32, -25.58],
  "缅甸": [96.20, 16.45],
  "纳米比亚": [17.04, -22.35],
  "尼泊尔": [85.20, 27.45],
  "荷兰": [4.54, 52.23],
  "荷属安的列斯": [-69.00, 12.05],
  "新喀里多尼亚": [166.30, -22.17],
  "新西兰": [174.46, -41.19],
  "尼加拉瓜": [-86.20, 12.06],
  "尼日尔": [2.06, 13.27],
  "尼日利亚": [7.32, 9.05],
  "诺福克岛": [168.43, -45.20],
  "北马里亚纳群岛": [145.45, 15.12],
  "挪威": [10.45, 59.55],
  "阿曼": [58.36, 23.37],
  "巴基斯坦": [73.10, 33.40],
  "帕劳": [134.28, 7.20],
  "巴拿马": [-79.25, 9.00],
  "巴布亚新几内亚": [147.08, -9.24],
  "巴拉圭": [-57.30, -25.10],
  "秘鲁": [-77.00, -12.00],
  "菲律宾": [121.03, 14.40],
  "波兰": [21.00, 52.13],
  "葡萄牙": [-9.10, 38.42],
  "波多黎各": [-66.07, 18.28],
  "卡塔尔": [51.35, 25.15],
  "韩国": [126.58, 37.31],
  "罗马尼亚": [26.10, 44.27],
  "俄罗斯": [37.35, 55.45],
  "卢旺达": [30.04, -1.59],
  "圣基茨和尼维斯": [-62.43, 17.17],
  "圣卢西亚": [-60.58, 14.02],
  "圣皮埃尔和密克隆": [-56.12, 46.46],
  "圣文森特和格林纳丁斯": [-61.10, 13.10],
  "萨摩亚": [-171.50, -13.50],
  "圣马力诺": [12.30, 43.55],
  "圣多美和普林西比": [6.39, 0.10],
  "沙特阿拉伯": [46.42, 24.41],
  "塞内加尔": [-17.29, 14.34],
  "塞拉利昂": [-13.17, 8.30],
  "斯洛伐克": [17.07, 48.10],
  "斯洛文尼亚": [14.33, 46.04],
  "所罗门群岛": [159.57, -9.27],
  "索马里": [45.25, 2.02],
  "比勒陀利亚": [28.12, -25.44],
  "西班牙": [-3.45, 40.25],
  "苏丹": [32.35, 15.31],
  "苏里南": [-55.10, 5.50],
  "斯威士兰": [31.06, -26.18],
  "瑞典": [18.03, 59.20],
  "瑞士": [7.28, 46.57],
  "阿拉伯叙利亚共和国": [36.18, 33.30],
  "塔吉克斯坦": [68.48, 38.33],
  "泰国": [100.35, 13.45],
  "马其顿": [21.26, 42.01],
  "多哥": [1.20, 6.09],
  "汤加": [-174.00, -21.10],
  "突尼斯": [10.11, 36.50],
  "土耳其": [32.54, 39.57],
  "土库曼斯坦": [57.50, 38.00],
  "图瓦卢": [179.13, -8.31],
  "乌干达": [32.30, 0.20],
  "乌克兰": [30.28, 50.30],
  "阿联酋": [54.22, 24.28],
  "英国": [-0.05, 51.36],
  "坦桑尼亚": [35.45, -6.08],
  "美国": [-77.02, 39.91],
  "美属维尔京群岛": [-64.56, 18.21],
  "乌拉圭": [-56.11, -34.50],
  "乌兹别克斯坦": [69.10, 41.20],
  "瓦努阿图": [168.18, -17.45],
  "委内瑞拉": [-66.55, 10.30],
  "越南": [105.55, 21.05],
  "南斯拉夫": [20.37, 44.50],
  "赞比亚": [28.16, -15.28],
  "津巴布韦": [31.02, -17.43],
};
