/**
 * 首页-世界地图
 *
 * @url /info/statByLocation/world
 *
 * method：GET
 * params:
 * 如为固定时间则：dateType=today or yesterday or week or month
 * 如为自定义时间则：startDay=2018-05-01&endDay=2018-06-18
 * 
 */

module.exports = {
  "status": "success",
  "result|60-105": [{
    "source|+1": ['中国', '阿富汗', '阿根廷', '澳大利亚', '奥地利', '阿塞拜疆', '孟加拉国', '比利时', '不丹', '巴西', '文莱', '保加利亚', '柬埔寨', '加拿大', '中非共和国', '智利', '哥伦比亚', '哥斯达黎加', '克罗地亚', '古巴', '塞浦路斯', '捷克共和国', '丹麦', '多米尼加', '埃及', '埃塞俄比亚', '芬兰', '法国', '德国', '加纳', '希腊', '格陵兰', '冰岛', '印度', '伊朗', '伊拉克', '爱尔兰', '以色列', '意大利', '日本', '肯尼亚', '基里巴斯', '韩国', '科威特', '老挝', '黎巴嫩', '莱索托', '利比亚', '卢森堡', '马其顿', '马拉维', '马来西亚', '马尔代夫', '马耳他', '毛里求斯', '墨西哥', '摩尔多瓦', '摩纳哥', '蒙古', '摩洛哥', '莫桑比克', '缅甸', '纳米比亚', '尼泊尔', '荷兰', '新西兰', '尼日尔', '尼日利亚', '挪威', '阿曼', '巴基斯坦', '巴拿马', '巴拉圭', '秘鲁', '菲律宾', '波兰', '葡萄牙', '卡塔尔', '罗马尼亚', '俄罗斯', '卢旺达', '圣马力诺', '沙特阿拉伯', '塞内加尔', '新加坡', '索马里', '南非', '西班牙', '苏丹', '瑞典', '瑞士', '叙利亚', '塔吉克斯坦', '泰国', '突尼斯', '土耳其', '乌干达', '英国', '美国', '委内瑞拉', '越南', '也门', '刚果民主共和国', '津巴布韦', '索马里兰'],
    "count|10-500": 10
  }]
}